# StairsRailingBalustersPerTread Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRailingBalustersPerTread Property
ParameterTypeId Class See Also
---
"Balusters Per Tread (Stair Railing Only)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRailingBalustersPerTread { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRailingBalustersPerTread As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRailingBalustersPerTread {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace